
[Abduction X2AbilityTemplate]
LocFriendlyName="Abduction"
LocFlyOverText="Abduction"
LocHelpText="Abduct a target who is stunned or disoriented."
LocLongDescription="The Sectoid Abductor will try and Abduct any target in its movement range that it has stunned or has in any way become stunned. If no stunned targets are available, it will try and abduct a disoriented target."

[AbductionMove X2AbilityTemplate]
LocFriendlyName="Abduction"
LocFlyOverText="Abduction"
LocHelpText="Abduct a target who is stunned or disoriented."
LocLongDescription="The Sectoid Abductor will try and Abduct any target in its movement range that it has stunned or has in any way become stunned. If no stunned targets are available, it will try and abduct a disoriented target."


[AbductorStunShot X2AbilityTemplate]
LocFriendlyName="Stun Shot"
LocFlyOverText="Stun Shot"
LocHelpText="A special shot that can be taken from the Sectoid Abductor's wrist weapon that will cause stun."
LocLongDescription="The ability can cause those hit by the shot, to become stunned."


[SectoidAbductor X2CharacterTemplate]
strCharacterName="Sectoid Abductor"

[SectoidAbductorM2 X2CharacterTemplate]
strCharacterName="Sectoid Abductor"

[SectoidAbductor_WPN X2WeaponTemplate]
FriendlyName="Abductor Beam Pistol"

[SectoidAbductorM2_WPN X2WeaponTemplate]
FriendlyName="Abductor Beam Pistol"

[SectoidAbduction X2SitRepTemplate]
FriendlyName="Sectoid Abductions"
Description="The Aliens are abducting civilians and Resistance in the area."

[SectoidAbductionEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="Sectoid Abductions"
Description="It seems that the Aliens have sent in a large contingent of Sectoids and ADVENT support troops to grab as many civilians and or Resistance targets in the area. They may have already abducted their intended targets. Be on high alert, Commander."


[SecureUFOAbductors X2MissionTemplate]
DisplayName="Secure the landed Sectoid UFO"
Briefing="Our Resistance contacts have reported Alien Sectoids recovering rogue Advent in this area. Secure the UFO and grab anything you can."
PostMissionType="Secure the landed Sectoid UFO"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy targets"
ObjectiveTextPools[1]="Secure Sectoid UFO for supplies"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_05"

[SecureUFOAbductors X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Neutralize all enemies guarding UFO"
ObjectiveTextPools[1]="Deactivate enemy Distress Beacon"
ObjectiveTextPools[2]="Extract all XCOM soldiers"